# 추론통계학
# 모집단 - 통계 조사에서 조사대상이 되는 전체 집합
# 표본  - 모집단에서 뽑은 일부 자료
# 모집단에서 추출된 표본으로 부터
# 모수와 관련된 통계량들의 값을 계산하고 이것을 이용해서 모집단의 특성을 알아내는 과정
# 여기에 예측, 머신러닝등을 이용해서 나온 분석 결과가 통계적으로 유의미한지 검증까지 함

# 기술통계학 - 과거 사건들로 부터 수집된 자료를 요약
# 추론통계학 - 어떤 일에 대한 미래에 발생할 가능성을 예측
# 모집단 - 통계 조사에서 조사대상이 되는 전체집합
# 표본 - 모집단에서 뽑은 일부 자료

# 모집단에서 추출된 표본으로부터 모수와 관련된 통계량들의 값을 계산하고 
# 이것을 이용해서 모집단의 특성을 알아내는 과정


# 과연 몇 % 의 고객이 게임을 구매할까?
#  어떤 제품의 불량품 검사
#-전수검사 불가능
#-표본추출 후 추정
# 의사 결정에는 불확실성이 내재되기 때문에 알여진 위험은 과학적으로 분석되어야함
# -> 불확실성 이론이라 불리는 확률론이 이러한 분석에 도움
# 실험, 사건, 주관적 확률, 덧셈 법칙, 곱셈법칙

# 확률 
# 어떤 사건이 일어날 상대적 개연성을 나타낼 0,1 사이의 값 : 70%, 0.35
# 확률값은 1은 확실하게 일어나는 일으 의미
# 확률값은 0은 절대로 일어나지 않는 일을 의미

# 중요 용어 3가지
# 실험 : 여러 가지 예측 가능한 결과 중 어떤 하나가 발생하는 과정
# 결과 : 실험의 특별한 결과
# ex) 동전 던짐 - 실험
#     앞면, 뒷면 : 결과



# 확률 부여 방법
# 고전적 확률 - 상호률셈법칙, 여의법칙, 덧셈의 일반법칙, 곱셈법칙(독립사건), 조건부확률
# 경험적 확률 - 대수의 법칙
# 주관적 확률(!!) - 베이즈 정리, 사전확률, 사후확률 - 나이브 베이즈 


# 주사위를 굴려 4 이하 눈이 나올 확률 P는? -> 4/6
# 농구선수가 10게임에서 100개의 슛을 던져 78개의 골을 넣었을 때 슛 성공확률은? 
78/100
# 동전을 던저 앞면이 나올 확률은? 1/2
# 오후 9시~10시 주요 시청 방송국 현황이 다음과 같은 때 임의의 가구 kbs를 시청할 확률은?
 kbs 450, MBC 580, SBS 370, JTBC 200
 450/(450+580+370+200)
 
 # 경험적 확률
 사건이 일어날 확률은 과거에 비슷한 사건이 과거에 발생할 횟수의 일부분을 차지한다
 => 관측자가 관측하기 전에 가지고 있는 확률값
 => 나이브 베이즈 확률에서는 사전확률이라 함
 
ex) 동전을 던져 앞면이 나올 확률이 과연 1/2 일까? 
  이러한 시도를 여러번 해보면 앞면이 나올 확률은 0.5에 근접해 갈 것임
ex) NASA 가 수행한 113번의 우주임무에 2번의 실패를 경험했다. 미래 우주임무의 성공 확률은 ? 111/113

# 주관적 확률
# 활용 가능한 정보에 기초해서 어떤 개인이 결정한 특정 사건이 발생할 가능성(확률)

# 확률계산을 위한 덧셈법칙
# 각 사건들은 상호배타적이어야 함
# 하나 또는 다른 사건이 발생할 확률은 그들의 확률을 더한 것과 같음
# p(A U B) = P(A) + P(B)

ex) 어떤 상품의 무게의 적정/미달/초과 여부를 조사하기 위해 4000개를 표본 조사한 결과 다음과 같을 때 상품의 
무게가 미달 또는 초과할 확률은 얼마?
  미달 = 100개, 적정 = 3600개, 초과 = 300개
  답 : (100+300)/4000
  각 사건은 상호배타적 => 독립적 사건

여의 법칙
  ex) 상품이 미달일 확률이 P(A) 일때 미달이지 않을 확률 P(~A) = 1-P(A)
  

# 덧셈법칙
  ex) 경주를 방문한 관광객 200명을 표본 조사해보니 120명이 석굴암을, 100명이 불국사를 60명이 두곳 모두를
방문했다고 한다
이때 어떤 관광객이 석굴암 또는 불국사에 방문했을 확률은 0.8


중요 : 덧셈법칙이 2가지 존재하는 이유는 발생사건의 특성(독립성 여부에)에 좌우함


# 곱셉법칙
# 두 사건이 동시에 일어날 확률
# 두 사건은 반드시 독립적이어야 함
# 즉, 한 사건의 발생이 다른 사건의 발생화귤ㄹ에 
# 영향을 주지 않음 - 사건이 동시에 일어나지 않음
# P(A∩B) = P(A)*P(B)
ex) 주사위를 두번 던졌을때 4이하이고, 짝수의 눈이 나올 확률은? 
 
# 어떤 사이트의 회원들의 60% 가 이미 작년에 항공권 예매를 마쳤다고 할 때
  2명의 회원이 모두 작년에 예약했을 확률은? 36%
  2명의 회원 중 1명이 작년에 예약하고 1명은 예약하지 않을 확률은? 48%
  어느 누구도 작년에 예약하지 않았을 확률 16%

# 베이즈 정리
# 18세기 영국 장로교 목사였던 토마스 베이즈는 신이 실제로 존재하는가에 대한 문제로 고심
#

# 확률 곱셉 법칙을 이용하면
P(B|A) = P(A∩B)/P(A) 또는 P(A∩B)= P(A)P(B|A) =>
                                     P(A∩B) = P(B)P(A|B)에서
                          P(A|B) = P(A)P(B|A)/P(B)로 도출 가능
                          P(A|B) = P(A∩B)/P(A∩B)+P(~A∩B)
                          즉, 사건 B가 일어났을떄, 사건 A가 일어날 확률은 사건 A가 일어날 확률과 사건
                          B가 일어날 조건부 확미률의 곱을 사건 B가 일어날 확률로 나누어 알아낼 수 있다는 의미
                          사전 확률이 주어지고, 이제 따른 조건부 확률 및 주변 확률을 통해 조건과 결과를 서로 
                          바꾸어서 사후 확률을 계산하는 공식
                          이를 이용하면 실험을 통하지 않고 이미 알려진 사후확률을 이용해서 사후 확률을 
                          알나낼 수 있다는 의미
 ex) 내가 받은 메일 중 '반짝할인'이라는 제목의 메일이 스팸일 확률은?
  단, 내가 받은 메일 중 스팸이 있을 확률은 대략 10%, 메일 중 '반짝할인'이라는 메일을 받을 확률은 0;05,
  스팸메일이 '반짝할인'인 확률은 0.4이다.
P(A스팸) = 0.1 : 사전확률
P(B반짝할인) = 0.05 : 주변확률
P(B반짝할인|A스팸) = 0.4
사후 확률 P(A스팸|B반짝할인)=?
  P(A|B) =P(A)P(B|A)/P(B)
