# 나이브 베이즈 확률 이론
# 동전을 100회 던졌을때 앞면이 나오는 횟수는?
# 전통적 활률에서는 일어난 횟수/전체시도횟수로 계산
# 이를 경험적 확률이라 함 - 일정한 활률도 반복시행

# 만일, A라는 도시에 수지가 태어난 경우 
# 이 아이가 노벨상을 받을 확률은 얼마나 될까?

# 이것을 경험적 확률로 계산하려면 이 아이를 여러 명 살게 하고 
그 중 몇 명이 노벨상을 받는지 평가해보면 됨

# 문제는 동일한 유전자, 환경에 자란 아이를 만들 수 있는가 임
# 이러한 상황에서는 베이즈 확률론을 이용한다
# 일어나지 않은 일에 대한 확률을
# 불확실성이라는 개념으로 이야기함
# 즉, 이 사건과 관련된 여러가지 확률을 이용해서 새롭게 일어날 수 있는 사건에 대해 추정하는 것을 베이즈이론,
베이즈 추론이라 함

# 몬디홀 문제 - 미국 티비쇼에서 유래한 퍼즐
3개의 문 중 하나를 선택했을 때 문 뒤에 있는 상품을 주는 쇼

출현자가 한 문을 선택했을 때, 사회자가 다른 문을 열어 염소가 있을을 보여주고는 현재의 선택을 바꾸겠냐고 물음

이 때 출현자는 처음 선택을 고수하는 것이 나을까?
  출현자가 스포츠카를 가지려면 현재의 선택을 바꾸는게 나을까?
  
  아들 딸 패더독스
두 아이가 있는 어떤 집에서 [첫 아이가] 남자일 때 두 아이 모두가 남자일 확률은?
  두 아이가 있는 어떤 집에 [한 아이가] 남자일 때 두 아이 모두가 남자일 확률은?

#베이즈 정리
  이전의 경험과 현재의 증거를 토대로 어떤 사건의 확률을 추론하는 알고리즘
따라서, 사건이 일어날 확률을 토대로 의사결정을 하는 경우, 그에 관련된 사전정보를 얼마나 알고 있나에 따라 크게 좌우

ex) 2 개의 조립라인을 가진 공장에서 생산된 1000대의 휴대폰
1번/2번 조립라인에서 생산된 휴대폰의 불량률이 각각 10%, 15% 일떄, 임의로 뽑은 휴대폰이 불량일떄
이것이 1번 조립라인에서 생산되었을 확률은?
  
  
  # 베이즈 이론의 활용
  # 흉부외과 환자 303명 조사(나이, 성별, 검진정보)
  # 심장병 여부 판별
  
  # 개인의 나이, 성별, 직업 등의 데이터를 토대로 영화장르 추천 시스템 구축
  # 메일 제목으로부터 메일 종류를 분석
  # 무료, 빅데이터, 상담, 쇼핑, 광고, 모집, 회원
