# 확률분포
# 통계학 이론은 확률론에 근거
# 모든 확률변수는 특정한 확률분포를 가짐
# 확률분포 - 일어날 수 있는 미래의 결과들의 범위에 대한 가능성을 보여줌
예) 어떤 제품의 불량률이 5%라고 한다- 20개의 표본 중 최소 1개가 불량
=> 확률분포를 적용하면 불량의 개수는 0~20개 중 하나 일 수 있음

# 확률 변수
주사위 1개를 던졌을때 눈금 3이 나올 확률은? 1/6
주사위 1개를 던졌을때 눈금 5가 나올 확률은? 1/6
이렇게 일정하게 부여된 확률값(변수x)를 확률변수라고 함 - 1/6

# 확률분포 
일정한 패턴으로 확률값이 퍼져 있는 것을 의미
확률분포는 그래프와 표로 표시 가능
확률변수의 유형에 따라 이산/연속 확률분포로 분류

# 이산 확률분포
베루누이 분포, 이항분포binom, 다항분포multinom, 초기하분포hyper, 기하분포geom, 음이항분포, 포아송분포pois

# 연속 확률분포
균등분포unif, 정규분포norm, 지수분포, 감마분포, 베타분포, t분포t, 카이제곱분포chisq, F분포f


# 이항 확률분포
# 실험의 결과가 단 2개인실험에 대한 확률 계산
# 각 실험은 상호 배타적이어야함
# 확률분포는 여러번 시행한 결과, 성공이 나온 횟수에 대한 분포
# 성공확률은 반드시 알려져야 함 - 매 시행시 동일
# 각 시행은 서로 독립적이어야 함

# 베루누이 확률 분포
# 두가지 상황에 대해 1회 시행하는 경우 사용
# 제품생산시  양품/불량품 여부 파악
# 동전을 던졌을때 앞/뒷면 여부
# 시험에 합격/불합격 여부

ex) 전화가 오는 경우 남자인지 여부 파악(O)
ex) 주사위를 던졌을때 나오는 숫자 확인(X)

# 동전던지기, 시행횟수 10
sample(1:100,10)   # 1~100 사이의 임의의 수 10개 추출
sample(c('앞','뒤'),10) # sample의 기본값은 비복원 - 베루누이 시행불가  
p<-sample(c('앞','뒤'),10, replace = T)  
table(p)

# 확률분포를 그래프로 그림
p<- as.factor(p)
p<- as.numeric(p)
plot(p, col='red')
plot(density(p), col='red')
# 밀도 확률 곡선

# 출현확률에 가중치 50% 부여
p2 <- sample(c('앞','뒤'),10, replace=T, prob=c(0.5,0.5))
p2<- as.factor(p2)
p2<- as.numeric(p2)
plot(density(p2),col='red')

# 출현확률에 가중치 50% 부여 
p3 <- sample(c('앞','뒤'),10, replace=T, prob=rep(1/2,times=2))
table(p3)
p3<- as.factor(p3)
p3<- as.numeric(p3)
plot(p3, col='red')
plot(density(p3),col='red')
에

#이항분포
성공/실패 등의 2가지 상황이 나오는 실험에 사용 
베룬주이 시행과 다소 유사 하지마느 이항분포는 여러번 걸쳐서 하는 실험에 사용
현실적으로 베루누이 시행보다 이항분포가 많이 사용
즉, 동전을 1번 던져 앞면이 나오는 확률보다는 
10번 던져 앞면이 나올 확률에 관심이 많기 때문

binom 함수 이용
ex) 성공확률이 0.5인 베루누이 시행을 20회 했을 때 이항분포 값은?
  x<- dbinom(0:20,size=20, prob=0.5)
x  
plot(0:20, x, type = 'h', col='blue')

R에서 확률분포 명령은 다음 접두사를 결합해서 사용
d : 확률 밀도함수
p : 누적 분포함수
q : 분위수 계산함수
r : 특정 분포 난수 생성함수

ex) 1개의 동전을 4회 던졌을 때, 앞에 나올 횟수를 확률변수 x라 할때, 확률 분포는?
  단, 성공 확률은 0.5라 가정
   x<- dbinom(0:4,size=4, prob = 0.5)
   x
   plot(0:4, x, type = 'h', col='blue')
   
ex) 교통사고 10건 중 6건은 음주운전 사고라때, 교통사고 8건 중 음주사고가 6건일 
확률은?
  음주사고일 확률 - 6/10 =0.6
  
  dbinom(6, size = 8, prob=0.6)
  28*(3/5)^6*(2/5)^2  0.2090189
   
ex) 부산- 서울간 항공기 운항횟수는 5번있다
 연착할 확률이 0.2일 떄 한번도 연착하지 않을 확률은?
  dbinom(0, size=5, prob = 0.2)
  dbinom(1, size=5, prob = 0.2)
  
ex) 강릉에서는 휴대폰 통화시도 중 5%가 실패한다 6번 시도 중 한번도 실패하지 않을 확률은?
  dbinom(0,size = 6, prob = 0.05)
  dbinom(1,size = 6, prob = 0.05)

  options('scipen'=100)
  
  dbinom(6,size = 6, prob = 0.05)
  dbinom(나올수, size= 총시행횟수, prob=확률)
  # 과학지수 표기로 출력 -> 원래 수로 출력
  
# 다항분포
  보통 3가지 이상의 상황이 설정된 실험에서 사용
  다른 분포에 비해 활용도는 떨어짐
  아무래도 한가지 상황을 정하고 성공/실패에 대한 실험이 대부분이기 때문임
  
  주사위 눈 5가 나올 확률 -- 베루누이
  주사위 눈 5가 3번 나올 확율 -- 이항분포
  주사위 눈 5가 1번, 3이 2번 나올 확률 - 다항분포
  dbinom(x, prob = y)
  dmultinom(c(1,2,0), prob=c(1/6,1/6,4/6))
  
  ex) 자동차 점유율이 다음과 같을때, 8명의 시민을 뽑았을때,
  2명은 현대, 3명은 수입차, 1명은 기아, 2명은 GM일 확률은?
  
  현대 32%, 기아 30%, 수입차 14%, GM 11%, 르노 7%, 쌍용 6%
  dmultinom(c(2,3,1,2,0,0), prob=c(0.32,0.14,0.3,0.11,0.07,0.06))

ex) 주사위를 6회 던졌을때 1의 눈이 1회, 2 또는 3의 눈이 2회,
4 또는 5 또는 6의 눈이 3회 나올 확률은?
  dmultinom(c(1,2,2,3,3,3),prob = rep(1/6, times=6))
  
ex) 어떤 과일이 상,중,하, 불합격등 4종류로 분류
상: 25%, 중: 40%, 하: 25%, 불합격: 10% 일때
임의로 20개를 뽑았을때 과일 등급이 각각 5,8,4,3개가 포함될 확률은?
  dmultinom(c(5,8,4,3), prob= c(0.25,0.4,0.25,0.1))

# 초기하 분포
이항 분포는 복원추출로 매 실험이 조건이 일정할 때 사용 
초기하 분포는 비복원추출로 일정하지 않을 때 사용

ex) 빨주노초파색 5가지 색의 공이 있는 있는 상자에서 
빨강색의 공을 하나 뽑을 확률은? 2/10
다음 실험에서도 이 색의 공을 뽑을 확률은? 
먼저 뽑은 공을 다시 상자에 넣고 시행 : 2/10 이항 분포
뽑은 공을 상자에 넣지 않고 시행 : 1/9 초기하 분표
dhyper(x,m,n,k)
x: 뽑은 공의 수
m: 대상 공
n: 나머지 공
k: 비복원 추출횟수
dhyper(2,2,8,2)

ex) 어떤 부서 50명의 직원 중 40명은 노조에 가입한 직원이라 한다. 경영진과의 
협상에 참여하기 위해 5명의 직원을 뽑는다고 할때 
5명 중 4명이 노조에 가입한 직원일 확률은?
dhyper(4,40,10,5)
  
  
ex) 백화점의 16대 운송트럭 중 5대가 기준치 이상의 매연을 방출한다
검사를 위해 8대의 트럭을 무작위로 뽑았을때 매연을 방출하는 트럭이 적어도 3대,
또는 매연을 방출하는 트럭이 3대 이하일 확률은?
dhyper(3,5,11,8)案件
odds<-dhyper(0:3,5,11,8)案件
sum(odds)
ex) 어떤 회사의 상품 100개 중 15개가 불량품이라 할떄 임의로 20개를 뽑았을때 
불량이 3개 이상 나올 확률은?
odds<-dhyper(3:15,15,85,20)
sum(odds)
odds<- dhyper(0:2,15,85,20)
1-sum(odds)


# 포아송 분포
발생횟수와 그에 따른 확률을 구할 때 사용
ex) 1 시간동안 은행에 방문한 고객수
1시간 동안 콜센터에 걸려오는 전화 수
1년 동안 발생하는 비행기 사고수
1 페이지당 오타자가 발생하는 건수

일반적인 이산형 확률분포는 실험의 총 수 와 그에 따른 성공/실패 횟수가 중요
반면, 포아송 분포는 일정한 시공간에서 일어나는 사건의 발생횟수가 중요 - 실패횟수는 의미 x
무작위로 생하는 평균 횟수를 의미

포아송분포 조건 :가능성이 희박한 사건 법칙 성공확률이 낮고 n값이 큼
즉, 사건이 발생할 확률은 간격의 크기에 비례

ex) 어떤 사건의 평균발생횟수가 3일 때 0 회부터 10회 포아송분포 그래프를 그리세요
x<-dpois(c(0:10),lambda = 3)
plot(x,type='h')

ex) A은행은 시간당 평균 방문고객수가 3인 포아송분포를 따른다고 할때, 시간당 방문고객수가 
5명일 확률은?
dpois(5,lambda = 3) 

ex) A은행은 시간당 평균 방문고객수가 20인 포아송분포를 따른다고 할떄, 
시간당 방문고객수가 15명일 확률은?
dpois(15, lambda = 20)
  
ex) 부산-서울간 운행하는 트럭의 평균 고장횟수가 0.3이라 할 때 
고장이 1번 발생할 확률은?
 dpois(1,lambda = 0.3)
   
ex) 어떤 항공사는 분실되는 가방에 대해 걱정하고 있음 500편의 항공기를 표본추출해보니
20개의 가방이 분실 
가방이 분실되지 않을 확률은?
1개의 가방이 분실된 확률은?
1개 이상의 가방?
dpois(0, lambda = 0.4)  
dpois(1, lambda = 0.4)
1- dpois(0, lambda = 0.4)  

ex) 빵 100개를 만드는데 건포도 1000개를 섞었다
빵 1개에 건포도가 10~15개 있을 확률
dpois(c(10:15), lambda = 1000/100)


ex) 불량률이 2%인 제품더미에서 임의로 100개를 추출할 때
그 안에 불량품이 3개 이상 포함될 확률은?
1- sum(dpois(0:2, lambda = 0.2*100))
sum(dpois(3:100, lambda = 0.2))

# 포아송 분포를 이용해서 이항 확률을 추정
# 시행횟수 n 값이 크고 성공확률이 작은 경우
# 포아송 분포는 이항 분포의 제한된 형태와 유사
# 즉 n값이 크고, 성공확률이 작은 이항분포 문제는
# 포아송 분포 공식을 이용해서 확률을 구할 수 있음
# 이 때의 람다값 = 시행횟수 * 확률

ex) 어떤 지역에 강력한 허리케인이 강타할 확률이 0.05라고 할 때
30년 동안 적어도 한번은 허리케인이 강타할 확률은 얼마인가?
  1- dpois(0, lambda = 30*0.05)

ex) 도서 회원 중 5%는 연체 중이라 할때 100명의 도서회원을 조사했을때 연체할 회원이 
10명일 확률은?
  dpois(10,lambda = 100*0.05)
  dbinom(10, size=100, prob=0.05) --- 이항분포 dbinom 함수로 풀었을때
options('scipen'=100)
