# 연속확률분포
# 특정 범위내 발생 가능한 값들이 무한대로 많은 경우의 확률분포
이산확률분포들은 정수로 딱 셀 수 있기 때문에
성공/실패 횟수를 세서 횟수에 대한 확률을 구함

반면, 연속확률분포는 정수로 셀 수 없기 때문에 횟수에 대한 개념이 없음

따라서, 구하고자 하는 사건을 구간으로 산출하고, 구간의 면적으로 확률을 구함
즉, 사건을 그래프로 산출하고, 그래프의 면적으로 확률을 계산

이 때, 구간의 총 면적은 1 또는 100% 이다 
확률의 총합은 1 또는 100% 이므로

예를들어, 구하고자하는 사건이 총면적의 절반이면 확률은 0.5 또는 50%라는 의미

하지만, 총면적 모양이 항상 네모반듯하지는 않음
정규분포는 평균에 가까울수록 분포가 많고 평균에서 멀어지면 분포가 감소 - 종모양
이렇듯, 연속확률분포에 따라 총면적 모양이 모양이 다름


# 3가지 중요 연속확률분포
# 균등분포, 정규분포, 지수분포

# 균등분포
# 확률변수의 값은 최소/최대값으로 결정됨
즉, 최소/최대값으로 정해진 구간에 속하는 모든 값에 대한 가능성은 균일하다고 가정함
=> 모든 확률변수에 대해 동일한 확률을 가짐
그래프로 그리면 사각형 모양을 띔

ex) 한 주유소에서 팔리는 휘발유의 양이 2000~5000리터 사이의 균등분포를 따를때
확률변수는 하루 중 판매되는 휘발유 x 리터를 의미
쇼핑몰 회원가입 절차는 5~10분 정도 걸린다고 할때 
확률변수는 1명의 고객이 회원가입시 걸리는 x분 의미

ex) 최소/최대가 0/2인 균등분포에서 0.5일 확률?
   최소/최대가 0/2인 균등분포에서 0.5이하 확률?
   최소/최대가 0/2인 균등분포에서 0.5이상 확률?
  
dunif(0.5,min= 0,max = 2)

punif(0.5,min= 0,max = 2, lower.tail = T)
punif(0.5,min= 0,max = 2) # 기본값은 n 이하
punif(0.5,min= 0,max = 2, lower.tail = F)

# 균등분포 그래프 그리기
val <- dunif(0.5,min= 0,max = 2)
plot(y=val,x=0.5)

vals <- dunif(0:2,min= 0,max = 2)
plot(y=vals,x=0:2)

vals <- dunif(-1:3,min= 0,max = 2)
plot(y=vals,x=-1:3, type='l')

a<-0.5:2
b <- dunif(a,0,2)
polygon(c(0.5,a,2),c(0,b,0),col='pink')

ex) 제주도 여행을 가기 위해 비행기를 타는데, 인천공항에서 제주공항까지 60~70분 걸린다고 할때,
비행기가 64~67분 사이에 도착할 확률을 구하세요
punif(67,min=60, max=70)-punif(64,min=60, max=70)

서울에서 춘천까지 고속버스를 타는데 70~80분이 걸린다고 한다.
이때 74분 안에 춘천까지 도착할 확률은?
punif(74, min=70, max=80)
punif(74, min=70, max=80,lower.tail = T)

시멘트 회사의 주간 시멘트 생산량은 100~170톤 사이이다 
이 회사가 다음주에 시멘트 155톤 이상을 생산할 확률은?
punif(155, min=100, max=170, lower.tail = F)
vals <- dunif(90:180,100, 170)
plot(vals, x=c(90:180), type='l')  

어떤 학교의 통학버스를 타기 위한 대기시간이 
0~30 분 사이라고 할 때 25분 이상을 기다려야 할 확률은?
10~20분 사이를 기다려야할 확률은?
vals <- dunif(-10:40,0,30)
plot(vals, x=c(-10:40), type='l')  

a<-(25:30)
b<- dunif(a,0,30)
polygon(c(25,a,30),c(0,b,0),col='pink')
poly

punif(25, min=0, max=30, lower.tail = F)
punif(20, min=0, max=30, lower.tail = T)-punif(10, min=0, max=30, lower.tail = T)


# 정규분포
통계에서 가장 중요한 분포
일명 가우스 분포라고도 함
경영, 경제, 사회, 자연 현상 등 
많은 다양한 분야의 현상 등이 이 분포를 띔
예를 들어, 한국 성인 남자 평균 몸무게가 75kg 이라면 
75kg을 벗어난 사람들도 존재하지만 벼로 많지 않음

다른 예로 선거에서 난 이 후보를 찍었는데 떨어졌거나 찍지 않았는데
당선된 경우 - 정규분포의 특징

# 정규분포의 특징
평균 근처에 데이터의 분포가 많고 
평균에서 멀어질수록 데이터 분포가 감소
그래프 모양은 종모양을 나타냄 - 좌우 대칭
곡선은 평균에서 시작해서 양 극단으로 갈수록 점점 0으로 가까워짐
- 가까워질뿐 만나지는 않음

서로 다른 공장의 근로자 근속연수를 정규분포로 나타냄
평균 근속연수는 20년으로 동일하지만
각 공장별로 표준편차가 3.1/3.9/5.0년으로 다름
dnorm(x, mean=20, sd=3.1)
x<-seq(0,40)
plot(dnorm(x, mean=20, sd=3.1),type='l',col='red')
lines(dnorm(x, mean=20, sd=3.9),type='l',col='purple')
lines(dnorm(x, mean=20, sd=5.0),type='l',col='blue')
# 표준편차가 커질수록 첨도가 낮아짐

어떤 3개의 상품무게를 정규분포로 나타냄
각 상품의 평균은 283/301/321g으로 다름
단, 표준 편차는 1.6으로 모두 동일
x<-seq(250,350)
dnorm(x, mean = 283, sd=1.6)
plot(dnorm(x, mean=283, sd=1.6),type='l',col='red')
lines(dnorm(x, mean=301, sd=1.6),type='l',col='purple')
lines(dnorm(x, mean=321, sd=1.6),type='l',col='blue')

그래프의 면적을 구하기 위해서는,
해당 구간에 해당하는 x축 좌표를 알아야 하는데
이x축의 좌표는 어떻게 구할까?
정규분포의 x축 좌표는 보통 z값이라 부르는데, 
이 z값을 구하는 방법이 정규분포 공식을 사용해서 정규분포 표준화를 하는 것

문제는 매실험마다 그래프의 함수와 면적 넓이를 계산하는 것은 복잡하고
매우 불편함 그래서 이러한 불편을 줄이고자 표준이되는 기준을 만들었는데,
그것이 바로 평균=0, 표준편자 1인 '표준 정규확률분포' 임

면적을 직접 계산하지 않고 미리 계산된 확률값이 표시된 확률표를 사용해서 
확률값을 찾음
각자의 평균과 표준편차로 인해 정규분포의 종류도 수없이 많이 나옴
모든 정규분포에 대한 확률표를 만드는 것은 불가능
-> 표준 정규화 필요

z값 : 관측치 x에서 평균으로 빼고 표준편차로 나눈 값
pnorm(1, mean=0, sd=1)
# 평균이 0이고 편차가 1인 정규분포에서
# 1 이하 정규분포 확률
a<-seq(-5,5, length=100)
b<-dnorm(a, mean=0, sd = 1)
plot(a,b,type='l',col='red')

c<-seq(-5,1, length=100)
d<-dnorm(c, mean=0, sd = 1)
polygon(c(-5,c,1),c(0,d,0), col='pink')


성인 남자 키는 평균 173cm, 표준 편차 5인 정규분포를 따른다고 할때,
185cm이상인 사람의 비율을 구하기 위한 Z값은 얼마인가?
z = (x - 평균) / 표준편차
  = (185-173) / 5 =2.4

173의 z 값은? (173-173)/5 = 0
pnorm(185, mean=173, sd=5, lower.tail = F)

a <- (153:193)
b <- dnorm(a,mean=173,sd=5)
plot(a,b,type='l',col='red')

c<- (185:193)
d<- dnorm(c,mean=173, sd=5)
polygon(c(185,c,193),c(0,d,0),col='pink')


ex) 우버 택시 기사 수입이 평균 1000달러,
표준편차 100달러인 정규분포일 때
a<- 800:1200
b<- dnorm(a,mean=1000,sd=100)
plot(a,b,type='l',col='red')
 

주당 수입이 1100달러에 해당하는 z값은?
z <- (1100-1000)/100
z

주당수입이 900달러에 해당하는 z값은?
z <- (900-1000)/100
z
주당수입이 900달러 이하일 확률은?
pnorm(900,mean=1000,sd=100)
c<- 700:900
d<-dnorm(c,mean=1000,sd=100)
polygon(c(700,c,900),c(0,d,0),col='pink')

주당수입이 800~1200달러 이하일 확률은?
pnorm(1200,mean=1000,sd=100, lower.tail = T) - pnorm(800,mean=1000,sd=100,lower.tail = T)

주당수입이 1000~1100달러 이하일 확률은?
pnorm(1100,1000,100) - pnorm(1000,1000,100)
   
정규 분표로 그리기........


ex)어떤 전구회사에서 생산하는 전구의 수명이
평균 800일, 표준편차는 40일인 정규분포를 따를때 
전구의 수명이 750일 확률은?
pnorm(750,800,40)
또는 전구의 수명이 750이상일 확률은?
pnorm(750,800,40, lower.tail = F)
  
  
    
어떤 고등학교 3학년 학생들의 수학성적은 70이고 표준편차가 8인 정규분포를 따를때
점수가 80이상 90이하인 학생 비율은?
pnorm(90,70,8)-pnorm(80,70,8)  





체비셰프 정리
정규분포에서 관측치 값의 68%는 평균을 중심으로 +-표준편차x1한 값 사이에 값이 존재
정규분포에서 관측치 값의 95%는 평균을 중심으로 +-표준편차x2한 값 사이에 값이 존재
정규분포에서 관측치 값의 99.7%는 평균을 중심으로 +-표준편차x3한 값 사이에 값이 존재



어떤 베터리의 수명 테스트를 실시하였는데
평균 수명시간이 19시간이고 표준편차는 1.2의 정규분포를 따른다고 한다.
'체비셰프의 정리'를 이용해서
전체 수명 중 68%에 속하는 두 값은?
(왼쪽) 19 -(1.2*1) = 16.6
(오른쪽) 19 +(1.2*1) = 20.2

전체 수명 중 95%에 속하는 두 값은? 
  (왼쪽) 19 -(1.2*2) = 16.6
(오른쪽) 19 +(1.2*2) = 21.4


# 자동차 타이어 평균 수명이 67000km와 표준편차 2050km를 따르는 정규분포라 할때
판매 타이어의 4%미만에서만 교환 요청시 교체해주려 한다면,
타이어 보증 km는 얼마로 설정해야 하는가?
단, 정규분포 확률 0.4600에 대한 z값은 1.75이다
z 값
x<- 60000:75000
y<- dnorm(x,67000,2050)
plot(x,y,col='red')
w<- 60000:63412.5
z<- dnorm(w,67000,2050)
polygon(c(60000,w,63412.5),c(0,z,0),col='pink')

x 표본값 구하기
z= (x-평균)/표준편차

평균 67000
표준편차 2050
4% 이하 확률값 0.5-0.04 =0.46

-1.75*2050+67000   63412.5km 이하일 경우
 


     