연속확률분포 중에서 일정구간에서 일어날 확률이 균일할때는
균등분포를 사용

평균에 가까울수록 일어날 확률이 커지고 평균에서 멀어질수록 확률이 작아질 때는
정규분포 사용

반면, 시간이 지날수록 확률이 작아지는 경우에는 지수분포를 사용

ex) 백화점 안내데스크에 고객 문의 요청 시간간격 
특정 웹사이트 방문 시간 간격
주방 용품 수명 
고객센터에 걸려오는 고객 문의 전화 시간 간격

따라서 포아송분포는 단위 시간/공간 안에서 발생하는 어떤 사건의 횟수에 대한
확률을 계산
반면, 지수분포는 어떤 사건이 처음으로 발생하기까지 걸린 시간을 기준으로, 
이 시간내 발생하는 사건에 대한 확률을 계산함

따라서, 이 시간 전 사건 발생확률은 0이고,
이 시간 이후 사건의 평균 발생 빈도는 '1/람다'가 됨



exp(?,rate=?)

# 이산확률분포의 포아송분포와 밀접한 관련이 있음
ex) 어떤 레스토랑의 저녁시간에는 시간당 6명이 방문한다고 가정할때,
시간당 5명 방문할 확률, 7명 방문할 확률을 구하는 것은 포아송분포
반면, 다음 고객이 10분이내/30분이후 방문할 확률을 구하는 것은 지수분포임


ex) 전자제품회사에서 생산하는 스마트폰 부품은 평균수명이 5년이고, 지수분포를 
따른다고 할 때 이 부품이 고장나지 않고 6년이상 수명이 지속될 확률은 얼마인가?
  pexp(6, rate = 1/5, lower.tail = F) 
plot(dexp(0:5,rate=1), col='red', type='l')
lines(dexp(0:5,rate=0.5), col='orange', type='l')
lines(dexp(0:5,rate=1.5), col='blue', type='l')


ex) 어떤 약국에는 평균 20초당 1건의 처방전이 도착한 다음
처방전이 5초이내에 도착할 확률은 얼마인가?
또한, 다음 처방전이 40초 이후에 도착할 확률은?

a <-  0:100
b<-dexp(a,rate = 1/20)
plot(b,type='l', col='red')
c<- 0:5
d<-dexp(c,rate = 1/20)
polygon(c(0,c,5),c(0,d,0), col='pink')

pexp(5,rate = 1/20, lower.tail = T)
plot(b)

pexp(40,rate = 1/20, lower.tail = F)

c<- 40:80
d<-pexp(c,rate = 1/20, lower.tail = T)
polygon(c(40,c,80),c(0,d,0), col='blue')
  
ex) A회사에서 판매중인 휴대폰의 평균수명은 3년인데 보증기간은 1년이라 할때,
1년 이내 고장나서 보상받을 확률은?
pexp(1,rate = 1/3, lower.tail = T)


  
ex)한 연인이 데이트를 하기 위해 만날때마다 남자가 항상 지각한다고 가정하자
이 남자의 평균 지각시간은 8분이고 지수분포를 따를 떄 다음 데이트 지각 시간이 
4분에서 11분일 확률은?
  pexp(11,rate = 1/8, lower.tail = T)-pexp(4,rate = 1/8, lower.tail = T)

ex) 어떤 회사의 전원공급장치의 수명에 대해 보증기간을 정하려한다
품질테스트 결과 이 장치의 평균 수명이 4000시간이라 할때,
판매된 제품의 5%만 교체해주려고 한다면
보증기간을 얼마로 정해야 할까?

  확률변수 x 에 대한 누적분포 함수식
1 - e^ (- 람다*보증기간)

plot(dexp(0:6000, rate =1/4000), type='l')
  

판매 제품 5%에 대해 => 분포 곡선의 면적이 0.05 
0.05 = 1 - e^ (- 1/4000*보증기간)
0.95 = e^ (- 1/4000*보증기간) 
공식 : log(0.95)=-1/4000*보증기간
log(0.95)
x= -0.05134/(-1/4000)
=205.2
 따라서, 보증시간은 약 205 시간으로 설정


ex) 서브웨이에서 샌드위치를 주문 후 기다리는 평균 대기시간이
60초인 지수분포를 따를 때 
30초 이하로 기다릴 확률은?
  pexp(30, rate=1/60) = 0.393
120초 이상 기다릴 확률은?
  pexp(120, rate=1/60, lower.tail = F) = 0.135
총 고객의 50% 고객이 기다려야 할 대기 시간은?
  log(0.5)/(-1/60)  41.58초

 
  