# 추정

보통 어떤 그룹(모집단)의 특징을 알고싶다 - 전수조사
현실에서는 시간/비용 상의 문제 때문에
모든 구성원 대상 조사는 어려운 - 표본이용(일부조사)

알고자하는 모집단의 특징을 숫자도 표현
-> 모수(평균, 분산, 비율, 표준편차)

표본으로 뽑은 데이터 - 통계량

표본의 통계량으로 "'모수'가 이럴것이다"라고 추리 -> 추정

ex) 한국 성인 남자의 평균 키 파악
모집단 - 한국 성인 남자

추정은 일부 데이터로 전체를 추리하기 때문에
100% 정답은 아니고,
점추정과, 구간 추정이 있음

# 점추정
추정치를 하나의 값(점)으로 표현
성인 남자의 평균 키 - 172.38cm(통계량)
그런데, 진짜 한국 남성의 평균키가 172일까?
당연히 그럴 확률은 희박 - 표본수 작음, 오차 존재
따라서, 특성상 점추정은 신뢰하기 어려운 면이 존재

ex) 하이마트에서 UHD TV를 구매한 고객의 표본 1000명을 평균 나이를 추정

# 구간 추정
추정치를 일정 구강으로 설정
성인 남자의 평균 키 - 172.38cm(통계량) 
=> 165~ 170 사이
이렇게 하면, 이 구간에 모수가 포함될 확률은 높아짐
추정치의 신뢰도를 높이고 점추정치의 한계를 극복하기 위해 
구간 추정을 사용함
 
ex) 서울지역의 IT노동자의 연간 평균 급여가 200만원이다 (점추정 - 신뢰도 저하)
180만원 ~ 220만원 사이에 있을 가능성이 85%이다
(구간 추정 - 어느정도 신뢰도 보장)


# 신뢰구간
점추정은 특성상 신뢰도가 떨어짐 - 구간추정으로 보완
그러면, 구간 추정시 어느정도까지 구간을 설정해야할까?
만일, 성인 남자 평균키에 대한 구간추정을 150~190으로 잡으면? - 너무 넓음
구간 설정이 짧을수록 좋다? - 너무 짧아도 문제
너무 넓지도, 짧지 않게 나름의 기준에 따라 신뢰가능한 구간을 설정 - 신뢰구간

즉, 주어진 확률로 모집단의 모수가 존재할 것으로 예상되는 값의 범위 -신뢰구간
이때, 주어진 확률을 신뢰수준이라 함


# 모평균에 대한 신뢰수준을 구하려면?
t.test() # t 분포 이용

# 단일 모집단의 모평균에 대한 신뢰구간 추정 및 검정
ex) A 회사의 금년도 대졸자 초임 조사
15명의 표본을 SRS로 뽑아 월 임금 조사
평균 임금 X에 대한 95% 신뢰구간은?
  
  
  salary <- c(165,159,170,168,170,172,167,158,170,171,164,165,168,167,171)
  mean(salary)  #  표본의 평균을 통해 점추정
  t.test(salary)  # 95% 신뢰구간 : 164.6692 ~ 169.3308
  t.test(salary, conf.level = 0.9) # 90% 신뢰구간 : 165.086 ~ 168.914
  t.test(salary, conf.level = 0.99) # 99% 신뢰구간 : 163.765 170.235
  
  # 한 공장에서 생산되는 소단위 소금 한 봉지의 무게가 다음과 같을 때 평균 무게를
  95%, 99% 신뢰 구간으로 추정하세요
  102, 103, 104, 103, 105,104,101,
  103,102,104,103,105,104, 101
  
  weight<-c(102, 103, 104, 103, 105,104,101,103,102,104,103,105,104, 101)
  t.test(weight) 102.3966 103.8891
  t.test(weight, conf.level = 0.99)    102.1024 104.1833
  
  # 단일 모집단의 모비율에 대한 신뢰구간 추정
  prop.test()
  
  ex) 어느 상표에 대한 선호도를 조사해보니 고객 100명 중 48명이 선호한다고 나타남
95%, 90% 신뢰구간을 조사한다면?
  prop.test(48, 100, conf.level = 0.95)
prop.test(48, 100, conf.level = 0.9)



ex) 어떤 대학의 학생 1350명 중 620명이 담배 한 갑을 핀다고 한다
지난주에 최소 한갑을 핀 학생의 모비율을 95%, 90% 신뢰구간으로 추정한다면?
  prop.test(620, 1350, conf.level = 0.95) 
prop.test(620, 1350, conf.level = 0.9)





# 중심극한정리
동일한 확률분포를 가진 독립확률 변수 n개의 평균값은 n이 적당히 크다면
정규분포에 가까워진다.

.opar <- par(no.readonly = T)
par(mfrow=c(2,2))

a<- rbinom(1000, 10, 0.25)
b<- rbinom(1000, 30, 0.25)
c<- rbinom(1000, 50, 0.25)
d<- rbinom(1000, 100, 0.25)

hist(a, title='n=10')
hist(b, title='n=20')
hist(c, title='n=30')
hist(d, title='n=40')

par(.opar)

# 알 수 없는 모집단에서 표본이 충분히 크다면, 
# 이 표본평균의 분포는 정규분포에 근사하다는 의미
# 주의사항 - 중심극한정리를 과도하게 맹신하면 실생활에 심각한 문제를 초래할 수 있음
-> 대부분의 상황을 정규분포로 가정
-> 2008년 금융위기 초래



신뢰구간을 계산하기 위해서는 표본평균과 표본 편차가 필요

중심극한정리를 통해서 
표본평균의 99% 모평균을 중심으로 양쪽으로 표준편차의
2.58배 이내에 존재한다
표본평균의 95% 모평균을 중심으로 양쪽으로 표준편차의
1.96배 이내에 존재한다
표본평균의 90% 모평균을 중심으로 양쪽으로 표준편차의
1.65배 이내에 존재한다

ex) 어떤 프렌차이즈에서 소매점 매장 관리자의
평균수입에 대한 정보를 알고자 한다
49명의 관리자의 표본평균이 45,420원이라 하고 
표준편차는 2050이라 할때 모평균과 95% 신뢰구간은?

  모평균: 점추정으로 구한 평균을 모평균으로 생각해도 좋음 45,420

  구간추청 : 특정 신뢰수준 z값 x (표준편차) / sqrt(표본수)
           1.96*2050/sqrt(49) = 574
  
  따라서, 신뢰구간은 45,420-574 ~ 45,420+574
           

ex) 맥도날드의 각 매장의 일일 매출액이 평균 20000원, 표준편차 3000원이고
표본은 40개 매장을 대상으로 했을때 모평균과 95%, 99% 신뢰구간은?
95%
1.96*3000/sqrt(40) 929.7096
20000-930 ~ 2000+930

2.58*3000/sqrt(40) 1223.801
20000-1224 ~ 2000+1224
  
  
ex) 한국인이 일주일에 커피를 위해 소비하는 평균 지출액이 2000원이고 표준편차는
500원이다. 대상 표본수는 49명일 때 95% 신뢰구간은?
1.96*500/sqrt(49) = 140
2000-140 ~ 2000+140


# t 분포 
# 정규분포의 단점은 표본의 수가 많으면 - 신뢰도 상승
표본의 수가 작으면 신뢰도가 하강
예를들어 표본 5개를 뽑았는데, 평균 근처에 모여 있을 수도 있겠지만,
운이 없을 경우 한쪽으로 치우쳐 모여 있을 수도 있음

신뢰도를 높이기 위해 표본을 많이 뽑으면 좋겠지만,
시간/비용의 제약으로 그렇게 하지 못함
따라서, 정규분포보다 예측 범위를 넓게 잡아 신뢰도를 다소 높인 분포가 t분포임

영국의 양조기술자인 윌리엄 고셋에 의해 최초로 연구 - students 의 t 분포라고도 불림
보통, 표본의 수가 30개 이하면 t 분포를 이용해서 검정

t분포를 이용해서 검정 :
  특정신뢰수준t값 x (표준편차) / sqrt(표본수)

ex) 어떤 타이어 제조사에서 타이어 마모수준에 대해 조사한다.
50000km 를 운행한 10개의 타이어를 조사해보니 마모된 평균 수치는 0.32cm였고
표준편차는 0.09로 조사되었다
95% 신뢰수준의 t값은 2.262
2.262*0.09/sqrt(10) = 0.064
0.32-0.064  = 0.256
0.32+0.064  = 0.384


ex) playstation 매장 방문객의 1인당 소비액을 추정하려 한다
쇼핑을 마친 고객 20명의 지출액이 다음과 같을때 95% 신뢰구간은?
  (95%의 신뢰구간 t값은 2.093이다)
  
  4816, 4222, 4682, 5145, 2378, 4186, 5486, 3792, 5264, 4859, 5082, 4694,
6183, 6169, 4917, 6146, 5135, 5268, 5884, 4388

  play <- c( 4816, 4222, 4682, 5145, 2378, 4186, 5486, 3792, 5264, 4859, 5082, 4694,
             6183, 6169, 4917, 6146, 5135, 5268, 5884, 4388)
mean(play)  
sd(play)
2.093*sd(play)/sqrt(20)
mean(play)-421.775          
mean(play)+421.775
4513.025 ~ 5356.575

t.test(play, conf.level = 0.95)

# 모비율
모집단이 확률(비율)적으로 어떤 특성을 가지는 것
ex) 1개의 주사위를 던졌을때 1이 나올 확률
전체 사망자 중 암환자의 비율
특정 대학교 학생의 릅연자 비율

표본비율 = 성공횟수/표본수
신뢰구간 = 표본비율 +- z값sqrt(표본비울*(1-표본비율)/표본수)

ex) 노동조합의 임의로 뽑은 조합원 2000명 중 1600명이 특정 사안에 대해
찬성의견을 내고 있다. 모비율에 대한 점 추정치는? 95% 신뢰구간은?
표본비율 =1600/2000

신뢰구간 = 
  (1600/2000) - 1.96*sqrt((1600/2000)*(1-(1600/2000))/2000) = 0.782
  (1600/2000) + 1.96*sqrt((1600/2000)*(1-(1600/2000))/2000) = 0.818
신뢰구간 0.782 ~ 0.818
prop.test(1600,2000,conf.level = 0.95)


ex) 어떤 공직 후보자에 대한 선거 직후 유권자 500명을 대상으로 출구조사했더니
그 중 275명이 지지한다고 응답을 들었다
점추정치와 95% 신뢰구간은? 과연 이 후보는 당선을 예상할 수 있나?
  표본비율 =275/500
  신뢰구간 =  0.506 ~ 0.594
    275/500 - 1.96*sqrt((275/500)*(1-(275/500))/500) = 0.506
    275/500 + 1.96*sqrt((275/500)*(1-(275/500))/500) = 0.594
  prop.test(275,500,conf.level = 0.95)
  
  최소 50%이상 득표할 것으로 예상 - 당선 예상
  

# 가설검정
추론 통계학에서 중요시 여기는 3가지 부분
  1. 표본집단은 모집단을 대표할 수 있나?

  2. 표본의 확률분포는 어떤가?
     어떤 분포이냐에 따라 추정을 위한 기법이 달라짐
     단, 표본의 수가 많아지면 정규분포에 근사
  3. 추정된 결과는 신뢰할 만한가?
     추정된 결과를 활용할지 결정하는 요소
    

# 통계적 가설검정
  세상에는 수 많은 분야에 걸쳐 다양한 이론/관념이 존재
  이러한 이론/관념들은 그 자체로 정답이라기 보다는 '이럴것이다'라는 하나의
  가설에 불과
  정답은 아니고 가설이므로 항상 불완전함이 내포
  
  한편, 불완전함을 채우기 위해 새로운 가설이 등장함
  ex) 우주에 대한 사설 :
   신화적 상상 -> 천동설 -> 지동설

그런데, 새로운 가설이 이전가설보다 늘 합리적이고 신뢰적일까?
오히려 이전 가설이 더 합리적일수도 있음

통계적 관검의 가설
검정을 전제로 모집단ㅇ 모수에 대한 진술 또는 가정
ex) '하이마트에서 일하는 종업원의 평균임금은 200만원이다' - 가설
이 가설이 옳은지 알아보기 위해 모든 영업점을 다 돌기엔 어려ㅇ
일정수의 표본을 추출해서 표본 통계량을 조사하고 결정규칙에 따라 가설을 
채택하거나 기각할 수 있음

표본 통계량 조사 - 표본 평균 100만원 - 가설 기각?
표본 통계량 조사 - 표본 평균 196만원 - 가설 채택? 오차는 허용해도 되나?
  
통계적 관점의 가설검정
가설이 타당성 있는 진술인기 결정하기 위해
표본증거와 '확률이론'에 기반하여 수행하는 과정

이러한 가설검정은 수학적 증명을 동반하기 않고 받아들일 만한 증거만을 제공

가설검정을 위한 6가지 절차
귀무가설/대립가설 설정 -> 유의수준 선정
-> 검정 통계량 선택 -> 결정규칙 수립
-> 표본추출, 결론 도출 -> 결과 해석

1. 대립가설
충분한 증거를 제시할 때 채택되는 진술
ex) 상업적 항공기의 평균 수명은 25인지 알고 싶다
귀무가설 : 평균 25년이다
대립가설 : 평균은 25년 아니다

2. 유의수준 : 귀무가설이 사실임에도 귀무가설을 기각하게 되는 확률
일반적으로 소비자 관련 - 0.05
품질보증 관련 - 0.01
정치 여론 조사 관련 - 0.10

ex) 전자회로기판 PCB 생산업체에서 불량률이 6% 이하일때 계약업체로 선적해서
납품한다는 품질보증계약 체결
귀무가설 : 불량률이 6% 이하 - 선적 O
대립가설 : 불량률이 6% 이상 - 선적 X

4000개의 회로판에서 표본 50개 추출 -> 4개가 불량 -> 불량률 8% -> 선적 X
그런데, 4개 뷸량이 전체 4000개에서 유일하다면? 뷸량률 1% -> 선적취소 잘못된 결정
=> 제 1종 오류 : 귀무가설이 옳지만 기각했음(알파)

4000개의 회로판에서 표본 50개 추출 -> 2개가 불량 -> 불량률 4% -> 선적 O
그런데, 48개 뷸량이 전체 4000개에서 유일하다면? 뷸량률 98.8% -> 선적취소 잘못된 결정
=> 제 2종 오류 : 귀무가설이 옳지않지만 채택했음(베파)
(4000-48)/4000

3. z 검정값, t 검정값등을 사용

4. 결정규칙 수립 - 단측검정/양측검정
귀무가설이 기각될 특정 정건과 기각되지 않을 조건을 명시
일반적으로 기각 영역은 귀무가설이 발생할 가능성이 없도록 작게 설ㅈ

단측검정 : one sided, 한쪽 꼬리 검정
방향성(크다/작다)이 대립가설에 포함되는 경우 시행하는 검정
우측(오른쪽) 단측검정
ex) 농심의 '오징어다리' 스낵의 포장 중량이 500g미만인지 검정한다고 가정
귀무가설 : 포장 중량이 500g미만
대립가설 : 포장 중량이 500g이상
유의 수준 0.05일때 귀무가설이 기각된 영역은 임계값 1.645 기준 오른쪽 영역은
임계값 1.645 기준으로

좌측(오른쪽) 단측검정
ex) 농심의 '오징어다리' 스낵의 포장 중량이 500g미만인지 검정한다고 가정
귀무가설 : 포장 중량이 500g미만
대립가설 : 포장 중량이 500g이상
유의 수준 0.05일때 귀무가설이 기각된 영역은 임계값 1.645 기준 왼쪽 영역은
임계값 -1.645 기준으로

양측검정 -two sided, 양쪽 꼬리 검정 방향성(크기/작다)이 대립가설에 
포함되지 않는 경우 시행하는 검정
ex) 회계사의 연평균 수입은 5500만원이다
귀무가설 : 연평균 수입은 5500만원이다
대립가설 : 연평균 수입은 5500만원이 아니다

유의수준 0.05 일때 귀무가설이 기각된 영역은 임계값 -1.96(0.025), 1.96(0.025)
기준 양쪽영역

5. 결론 내리기
양측 검정의 경우 Z-값의 절대값이 임계값보다 크면 귀무 가설을 기각합니다.
Z-값의 절대값이 임계값보다 작으면 귀무 가설을 기각할 수 없습니다.
만약, 계산된 검정 통계량 z값이 2.34라면
귀무가설은 기각
계산된 검정 통계량 값이 0.71이라면
귀무가설은 채택





하지만, 발생할수도 있다.

유의확률 p-value 귀무가설이 참이라고 가정할때 
주어진 데이터가 관측될 확률 또는 극단적인 데이터가 관측될 확률

따라서, "유의확률이 유의수준보다 작으면 귀무가설을 기각할 수 있음"

6. 결과 해석
통계를 이용해서 가설검정이 모든 분야의 가설을 다 판단하지 못함
수학적 특성상 제약이 존재 (표본의 편중)

판단의 의사결정시 수학적 방법을 이용하는 것도 좋지만,
수학의 틀에서 벗어나 의사결정하는 것도 좋음
-> 동물적 직감, 영감을 이용


단일 표본 t 검정 - 흔하게 사용되는 분석은 아님 
단일 모집단의 평균값과 검정값을 비교할 떄 사용
ex) 초등학교 6학년의 전국 평균 키가 160cm일때,
강남 초등학교 6학년 10반 학생 30명의 평균키와 비교


전국 고등학교의 평균 수학점수가 45점이다 
어떤 학교의 학생들의 수학점수가 
35점/45점/40점이상/40점이하 인지가설검정을 한다면?
  58, 48,48,41,34,43,38,53,46
41,60,55,44,43,49,47,33,47,53
40,46,53,40,45,39,47,50,53

math <- c(58, 48,48,41,34,43,38,53,46,41,60,55,44,43,49,47,33,47,53,
            40,46,53,40,45,39,47,50,53)

options('scipen'=100)
t.test(math, mu=35, alternative = c('two.sided')) 기각


### 단측검정

어떤 학교의 학생들의 수학점수가 평균 45점 이상
귀무가설 : 평균 수학점수 45점이다
대립가설 : 평균 수학점수 45점이상이다
t.test(math, mu=45,alternative = c('greater')) 


어떤 학교의 학생들의 수학점수가 평균 45점 이하
귀무가설 : 평균 수학점수 45점이다
대립가설 : 평균 수학점수 45점이하다
t.test(math, mu=45,alternative = c('less')) 


ex) 어느 지역 중학교 1학년 남학생들의 몸무게를 전수 조사하니
평균 63kg, 표준편차 8.0kg이 나왔다 
2015년에 15명의 남학생을 표본추출해서 몸무게를 재보니
70.2, 54.9,67.0,60.5,63.4,61.9,65.9,71.8,66.1,72.6,73.0,68.7,70.3,66.2,55.6
일때 이 지역 남학생의 몸무게는 5년보다 증가했는가?
  
귀무가설  : 63kg 이다(이하)
대립가설  : 63kg 이상이다
weight <-c(70.2, 54.9,67.0,60.5,63.4,61.9,65.9,71.8,66.1,72.6,73.0,68.7,70.3,66.2,55.6)
t.test(weight, mu=63,alternative = c('greater')) 

결론 : 통계값이 임계값보다 크고 p-value = 0.0357 귀무가설 기각
       증가했음       


ex) 살모넬라와 관련된 질병은 특정 공장에서 생산된 아이스크림 때문인 것으로 추정
된다 가정
과학자들이 무작위로 9개의 아이스크림에서 살모넬라 균 농도를 다음처럼 조사했을때
0.593,0.142,0.329,0.691,0.231,0.793,0.519,0.392,0.418각
아이스크림에 함유된 살모넬라균의 농도가 0.3MNP/g이상인지 검정하세요

귀무가설 : 0.3 이다(이하)
대립가설 : 0.3 이상이다
icecream <-c(0.593,0.142,0.329,0.691,0.231,0.793,0.519,0.392,0.418)
t.test(icecream, mu=0.3 ,alternative = c('greater'))
t = 2.2051, p-value = 0.02927  귀무가설 기가

ex) 국제공항에서 고객들을 위해 주정차 공간을 제공하는데, 주정차 공간이 충분한지
알아보기 위해 주정차 평균시간이 15분을 넘는지 검정해야한다
최근 12명 고객의 주정차 시간을 분으로 조사했다
30, 24,28,14,2,39,23,23,28,12,31

time <-c(30, 24,2,14,20,39,23,23,28,12,31)
귀무가설 : 15분이다
대립가설 : 15분이상이다
t.test(time, m=15, alternative = c('greater'))
p-value = 0.01318 이므로 귀무가설 기각
결론 : 통계값이 t = 2.3919, p-value = 0.01892 귀무가설 기각
  주차시간은 15분이상이다



# 단일표본 t 검정
단일 모집단의 평균값과 검정값을 비교할 떄 사용
=> 표준편차는 알려져 있지 않음
t= (표본평균 - 가설모평균) / (표본표준편차/sqrt(표본수))

일반적으로 평균값에 대한 검정은
표준정규분포를 t분포로 전환해서 통계값을 구함
ex) 어떤 보험회사의 클레임 평균 처리비용이 60 달러라 할때 비용절감 정책을 
도입한 효과를 알아보기 위해
지난달 처리된 26건의 클레임을 표본으로 채택할 때
유의수준 0.01에서 처리비용이 평균 60미만인지 검정하세요
귀무가설 : 60 이상
대립가설 : 60 미만
45,49,62,40,43,61,48,53,67,63,78,64,76,48,54,51,56,63,69,58,51,58,59,56,57,38
claims <- c(45,49,62,40,43,61,48,53,67,63,78,64,76,48,54,51,56,63,69,58,51,58,59,56,57,38)
(mean(claims) - 60) / (sd(claims)/sqrt(26))
t 값은 -1.816503
t.test(claims, mu=60, alternative = c('less'))
단, 유의수준 0.01의 기각역은 2.485/-2.485 이다
t = -1.8165 이므로 -2.485을 넘어서지 못함 귀무가설 채택, p-value = 0.04065


# 단일 모집단 부포의 정규성 검정
hist(claims, freq = F, breaks= 26)
lines(density(claims), col='blue')

qqnorm(claims)
qqline(claims)

정규확률 산점도와 대각선을 기준으로 각 점등이 가깝게 선형을 이루면 정규성을 띈다고 봄


# 건장한 남성이 하루에 소비하는 물의 양은 
평균 1.4리터인 정규분포를 따른다
건강 캠페인으로 하루 최소 2리터를 마실 것을 권고하였다
10명의 성인 남성을 뽑아서 조사해보니
1.5,1.6,1.5,1.4,1.9,1.4,1.3,1.9,1.8,1.7 일때
유의수준 0.01에서 물 소비량은 증가했다고 볼 수 있나?
유의수준 0.01에서의 t값은 2.821로 한다
male<-c(1.5,1.6,1.5,1.4,1.9,1.4,1.3,1.9,1.8,1.7)
t.test(male, mu=1.4, alternative = c('greater'))
t = 2.9277, df = 9, p-value = 0.00841  0.01가 작으므로 물 소비량 증가

청소년 보건당국에서는 2017년 10대들은 하루 67건의 문자메세지를 보냈다고 
문자메세지를 보냈다고 발표했다 12명의 10대를 표본 추출하여 조사해보니
51,175,47,49,44,54,145,203,21,56,42,100 라 할때
유의수준 0.05에서 평균 메세지는 67건보다 크다할 수 있는지 검정하세요
t값 1.796
msg<-c(51,175,47,49,44,54,145,203,21,56,42,100) 
t.test(msg, mu=67, alternative = c('greater'))
t = 0.88627, df = 11, p-value = 0.1972  귀무가설채택(67건보다 작을 수 있다)

