# 머신러닝 개요
프로그램이 어떤 것에 대한 학습을 통해 기존의 모델이나 결과물을 개선하거나
예측하게끔 구축하는 과정

머신러닝 변천사
고전적 인공지능 시대(1950, 규칙기반)->
신경망 시대(1960) ->
머신러닝(1990, 통계기반) ->
빅데이터(2010) ->
딥러닝, 고급신경망(2013)

인공지능 - 인간의 지능을 흉내내다 인간이 할 수 있는 특정 작업을 
수행하도록 만드는 기술 - 규칙 기반
예) 이미지 분류, 얼굴인식

머신러닝- 인공지능을 제대로 구현하기 위한 시도 많은 양의 데이터와 알고리즘을
사용하여 스스로 훈련되어 작업 수행
즉, 코드를 작성하는 대신 데이터를 어떤 알고리즘에 공급하면, 데이터를 기반으로
한 자체 로직(모델, 규칙)이 만들어 짐

예) 손으로 쓴 숫자 데이터 -> 숫자 분류
    이메일 데이터 -> 스팸/비스팸 메일 분류

딥러닝 - 머신러닝을 다른 방법으로 구현
주로 인공신경망을 사용하는 머신러닝의 한 부류
지도학습, 비지도학습, 강화학습 모두 가능

머신러닝 학습 분류
지도학습 - 값/레이블을 예측하는 시스템 구축
           주어진 데이터와 정답(레이블)을 이용해서 미지의 상태나 값을 예측
          ex) 현재 주식시세 -> 미레 주식시세
           사용자의 구매상품데이터 -> 미래 구매 예정 상품

비지도 학습 -레이블이 없는 데이터 자체에서 유용한 패턴을 찾아내는 학습 방법
             비슷한 데이터를 묶는 군집화 
             데이터에서 이상한 점을 찾는 이상검출

강화학습 -기계가 환경과 상호 작용을 통해 정기적으로 얻는 이득을 최대화하도록하는 학습
          정기적으로 얻는 이득을 최대화하도록 하는 학습 
          바둑 프로그램이 바둑을 두는 경우, 현재수에서 다음 수를 선택하는 것은 지도학습에 속함
          하지만, 게임의 승패까지 고려해서 전체수를 보게 하는 수를 학습하는 과정이 강화학습


# 지도학습 대표적인 알고리즘
분류 - KNN, 로지스틱회귀, 의사결정트리, SVM, 나이브베이즈
회귀(예측) - 선형회귀, SVM, 의사결정트리, 시계열


# 비지도학습 대표적인 알고리즘
군집화 - 주성분분석, 요인분석
연관성 규칙

